In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [17]:
df=sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [23]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [27]:
df.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
283,1,3,male,19.0,0,0,8.05,S,Third,man,True,NaN,Southampton,yes,True

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [38]:
df['alive'].unique()

array(['no', 'yes'], dtype=object)

In [44]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [48]:

df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [50]:
df.duplicated().sum()

107

In [17]:
df.drop_duplicates()

NameError: name 'df' is not defined

In [27]:
df.reset_index()

NameError: name 'df' is not defined

In [13]:
df.isnull().sum()

NameError: name 'df' is not defined

In [31]:
sns.haetmap(df.isnull())
plt.show()

NameError: name 'sns' is not defined

In [35]:
df.drop

NameError: name 'df' is not defined

In [19]:
df.drop('deck',axis=1,inplace=True)

NameError: name 'df' is not defined

In [23]:
df.drop('deck',axis=1,inplace=True)

NameError: name 'df' is not defined

In [21]:
df.columns

NameError: name 'df' is not defined

In [25]:
df.dtypes

NameError: name 'df' is not defined

In [27]:
df['embark_town'].unique()

NameError: name 'df' is not defined

In [29]:
df['embark_town'].mode()[0]

NameError: name 'df' is not defined

In [ ]:
df['embark_town'].isnull().sum()

In [ ]:
df['embark_town].fillna('Southampton')

In [ ]:
df['embark_town'].fillna(df['embark_town'].mode()[0],inplace=True)

In [ ]:
df['embark_town].isnull().sum()

In [ ]:
df['age'].isnull().sum()